[
  {
    "icon": "layers",
    "title": "Distributed Systems Architecture",
    "description": "Over 2 years of experience building event-driven systems with Kafka, saga patterns, event sourcing, and workflow orchestration in production using .NET"
  },
  {
    "icon": "code",
    "title": "GitLab OSS Maintainer & Contributor",
    "description": "Maintainer of the vSphere fleeting plugin and contributor to Gitaly, the Git RPC service powering GitLab. Merged MRs in one of the largest Go codebases"
  },
  {
    "icon": "settings",
    "title": "Cloud-Native Infrastructure",
    "description": "Hands-on experience with Docker, Kubernetes, GitLab CI/CD, and Azure cloud deployments, with strong focus on observability and reliability"
  },
  {
    "icon": "trending-up",
    "title": "Go Ecosystem",
    "description": "Built CLI tools in Go, contributed to GitLab’s Go codebase, and maintained production-grade Go tooling. Transitioning from .NET to Go for distributed systems development"
  },
  {
    "icon": "zap",
    "title": "Real-Time & Streaming Systems",
    "description": "Implemented Kafka-based event streaming, SignalR-powered real-time dashboards, and distributed workflow monitoring with recovery mechanisms"
  },
  {
    "icon": "users",
    "title": "Remote-First Engineering",
    "description": "Experienced in asynchronous OSS collaboration, distributed teams, and remote workflows through contributions to GitLab and community projects"
  },
  {
    "icon": "layers",
    "title": "End-to-End Delivery",
    "description": "Capable of shipping complete features across the stack from backend services to frontend interfaces enabling rapid iteration in small, agile teams"
  },
  {
    "icon": "database",
    "title": "Data Layer Expertise",
    "description": "PostgreSQL, MongoDB with replica sets and aggregation pipelines, Redis, and custom event stores with encryption and multi-tenancy"
  },
  {
    "icon": "terminal",
    "title": "Linux Comfort",
    "description": "Daily Linux user fluent in command-line workflows, production debugging, and CLI development. Excels in terminal-first engineering environments"
  }
]
