{
  "name": "Santhanu Vinod",
  "currentRole": "Distributed Systems Engineer",
  "coreTags": ["OSS Maintainer", "GitLab Gitaly Contributor (Go)"],
  "profileLinks": {
    "github": "https://github.com/santhanuv",
    "gitlab": "https://gitlab.com/santhanuv",
    "linkedin": "https://www.linkedin.com/in/santhanu-vinod/"
  },
  "careerStartDate": "2023-09-11",
  "coreTechnologies": [
    "Go",
    "Kafka",
    "gRPC",
    "Event Sourcing",
    "PostgreSQL",
    "Docker & K8s"
  ],
  "mainSummary": "Maintainer of GitLab's vSphere fleeting plugin and contributor to Gitaly (Git RPC service). Building event-driven systems with Kafka, saga patterns, and event sourcing in production.",
  "subSummary": "Demonstrated Go proficiency through maintained OSS tooling and merged contributions to one of the largest Go codebases. Seeking remote Go distributed systems roles.",
  "statsSummary": [{ "value": ".NET → Go", "label": "Active Transition" }],

  "experiences": [
    {
      "role": "Software Engineer",
      "company": "QBurst",
      "location": "India",
      "period": "Sep 2023 – Present",
      "type": "Full-time",
      "description": "Software engineer building reliable distributed systems, backend services, and cloud infrastructure. Professionally experienced in .NET, focused on event-driven architectures, scalable service design, and cloud-native patterns.",
      "achievements": [
        "Implemented event sourcing with MongoDB, storing full snapshots and calculating deltas between them for analytics and tracking",
        "Designed and maintained a distributed mail service using Kafka, PostgreSQL, and MailKit, supporting multiple backend providers with secure credential management",
        "Architected and integrated WorkflowCore orchestration, enabling complex distributed workflows with saga patterns and custom retry mechanisms",
        "Integrated Keycloak-based user access management for multi-tenant environments, ensuring secure gRPC inter-service communication",
        "Secured and optimized Azure-based SaaS deployments through VNet segmentation, private endpoints, and Function App integrations while managing cost efficiency",
        "Delivered backend APIs and frontends leveraging schema-driven development with MongoDB and PostgreSQL, supporting advanced business rule validations",
        "Containerized and orchestrated backend services with Docker to streamline deployments and ensure environment consistency",
        "Developed and managed GitLab CI/CD pipelines with multi-stage deployments, reducing manual release overhead and improving delivery speed"
      ],
      "technologies": [
        "Kafka",
        "MongoDB",
        "PostgreSQL",
        "SignalR",
        "GitLab CI/CD",
        "Docker",
        "Azure",
        "Keycloak",
        "WorkflowCore",
        "MailKit",
        "C#",
        "ASP.NET Core",
        "Angular"
      ]
    }
  ],
  "education": [
    {
      "degree": "B.Tech in Computer Science",
      "school": "Saintgits College of Engineering",
      "location": "India",
      "period": "2019 – 2023",
      "focus": "Specialized in Computer Science & Engineering",
      "description": "Focused on foundational computer science concepts, distributed algorithms, and systems design, preparing for a career in backend and distributed systems engineering."
    }
  ],
  "ossMaintained": [
    {
      "name": "GitLab Runner Fleeting Plugin for VMware vSphere",
      "description": "Community-maintained plugin for provisioning ephemeral GitLab Runner VMs on vSphere, enabling scalable CI/CD pipelines in enterprise environments.",
      "role": "Maintainer",
      "technologies": ["Go", "GitLab Runner", "govmomi", "cloud-init"],
      "stats": { "stars": 5, "forks": 1, "contributors": 3 },
      "highlights": [
        "Designed and provisioned ephemeral build runners on vSphere using template cloning, improving CI/CD efficiency",
        "Actively maintained the plugin with bug fixes and responded to community contributions",
        "Officially listed in GitLab documentation as a community-supported plugin, establishing credibility in the OSS ecosystem"
      ],
      "url": "https://gitlab.com/santhanuv/fleeting-plugin-vmware-vsphere"
    }
  ],
  "ossContributed": [
    {
      "name": "GitLab Gitaly",
      "description": "Contributed to GitLab’s core Git storage gRPC service, powering distributed systems and ensuring reliable repository operations.",
      "type": "Reliability & Maintainability Improvements",
      "highlights": [
        "Fixed missing error handling in ReadMonitor for SSHArchive/SSHUpload, preventing silent failures and ensuring robust logging",
        "Implemented bottom-up reflection-based config serialization, making Gitaly’s config struct the single source of truth",
        "Explored AST-based top-down approach for config documentation generation, improving maintainability",
        "Proposed and implemented Git refs verification in housekeeping with Prometheus metrics, enhancing monitoring and reliability"
      ],
      "technologies": ["Go", "gRPC", "Git internals", "Prometheus"],
      "url": "https://gitlab.com/gitlab-org/gitaly"
    }
  ],

  "projects": [
    {
      "title": "Srotas",
      "description": "CLI tool for orchestrating API requests and testing distributed workflows.",
      "highlights": [
        "Built a Go CLI application with Cobra to chain API requests for simulating complex workflows.",
        "Enabled declarative scenario definitions and reusable orchestration patterns for testing distributed interactions.",
        "Structured testing framework helps debug APIs and validate multi-service behaviors.",
        "Showcases scalable architecture design and automation for API-driven workflows."
      ],
      "technologies": ["Go", "Cobra", "REST APIs"],
      "codeUrl": "https://github.com/santhanuv/srotas",
      "docsUrl": "https://santhanuv.github.io/srotas",
      "stars": 35,
      "forks": 4,
      "featured": true,
      "type": "Personal Project"
    },
    {
      "title": "SanArch",
      "description": "Profile-driven Arch Linux installer for automated system setup.",
      "highlights": [
        "Automates Arch Linux installation using YAML-based profiles for reproducible setups.",
        "Supports flexible system configurations and ricing workflows for self-hosted environments.",
        "Improves developer productivity by reducing manual system setup overhead.",
        "Single-maintainer project showcasing scripting, configuration management, and automation skills."
      ],
      "technologies": ["Python", "YAML", "Bash", "Linux"],
      "codeUrl": "https://github.com/santhanuv/sanarch",
      "stars": 12,
      "forks": 2,
      "featured": true,
      "type": "Personal Project"
    },
    {
      "title": "Placement Cell Management System",
      "description": "Full-stack platform to manage student placement records.",
      "highlights": [
        "Developed web application to manage, filter, and export student placement data.",
        "Implemented PostgreSQL schemas, REST APIs in Node.js, and React-based frontend dashboards.",
        "Improved recruiter workflow by providing structured and exportable placement data.",
        "Demonstrates full-stack development and backend database design skills."
      ],
      "technologies": ["React", "Node.js", "PostgreSQL"],
      "codeUrl": "https://github.com/santhanuv/placement-cell",
      "stars": 5,
      "forks": 1,
      "featured": false,
      "type": "Academic Project"
    },
    {
      "title": "Hospital Management System",
      "description": "CRUD-based platform for hospital administration.",
      "highlights": [
        "Implemented patient and staff management, appointment scheduling, and medical record storage.",
        "Built backend APIs with Node.js and MySQL, and frontend with React.",
        "Supports typical hospital workflows and database-driven CRUD operations.",
        "Demonstrates backend API design and database interaction skills."
      ],
      "technologies": ["React", "Node.js", "MySQL"],
      "codeUrl": "https://github.com/santhanuv/hospital-management-system",
      "stars": 3,
      "forks": 0,
      "featured": false,
      "type": "Academic Project"
    },
    {
      "title": "Decentralized E-Commerce Platform",
      "description": "Experimental Solana blockchain-based marketplace.",
      "highlights": [
        "Built decentralized e-commerce application with Rust smart contracts and React frontend.",
        "Implemented wallet integration, product listing, and purchasing flows on Solana blockchain.",
        "Focused on learning Rust ownership model, Solana programming, and conflict resolution patterns.",
        "Showcases experimentation with Web3, blockchain logic, and decentralized architectures."
      ],
      "technologies": ["Rust", "React", "Solana", "Web3"],
      "codeUrl": "https://github.com/santhanuv/solana-ecommerce",
      "stars": 0,
      "forks": 0,
      "featured": false,
      "type": "Academic Project"
    }
  ]
}
